import { createStore } from 'vuex'
import Swal from 'sweetalert2'

function updateLocalStorage(cart) {
    localStorage.setItem('cart', JSON.stringify(cart))
}
function updateLocalStorageInterested(interested){
    localStorage.setItem('interested',JSON.stringify(interested))
}
export default createStore({
    state: {
        cart: localStorage.getItem('cart') ? JSON.parse(localStorage.getItem('cart')) : [],
        interested: localStorage.getItem('interested') ? JSON.parse(localStorage.getItem('interested')) : [],
        Products: [
            {
                pr_id: 1,
                title: 'گوشی های هوشمند',
                product: [

                    {
                        id: 11,
                        name: 'Samsung Galaxy S22',
                        price: 40000000,
                        image: 'S22.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        country: 'کره جنوبی',
                    },
                    {
                        id: 12,
                        name: 'Samsung Galaxy S21',
                        price: 20000000,
                        image: 'samsungs21.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        country: 'کره جنوبی',
                    },
                    {
                        id: 13,
                        name: 'Samsung Galaxy A52S',
                        price: 12000000,
                        image: 'a52s.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        country: 'کره جنوبی',
                    },
                    {
                        id: 14,
                        name: 'آیفون ۱۲',
                        price: 12000000,
                        image: 'applephone.jpg',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        country: 'کره جنوبی',
                    },
                    {
                        id: 15,
                        name: 'شیائومی می ۱۱',
                        price: 12000000,
                        image: 'xiaomiphone.jpg',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        country: 'کره جنوبی',
                    },
                ]

            },
            {
                pr_id: 2,
                title: 'ساعت های هوشمند',
                product: [
                    {
                        id: 21,
                        name: 'ساعت هوشمند شیائومی',
                        price: 1000000,
                        image: 'Xiaomi.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        country: 'کره جنوبی',
                    },
                    {
                        id: 22,
                        name: 'ساعت هوشمند سامسونگ',
                        price: 10000000,
                        image: 'Samsung-watch.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        country: 'کره جنوبی',
                    },
                    {
                        id: 23,
                        name: 'ساعت هوشمند الجی',
                        price: 10000000,
                        image: 'Samsung-watch.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        country: 'کره جنوبی',
                    },
                    {
                        id: 24,
                        name: 'ساعت هوشمند اپل',
                        price: 10000000,
                        image: 'apple.jpg',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        country: 'کره جنوبی',
                    },

                ]
            },
            {
                pr_id: 3,
                title: 'یخچال های ساید بای ساید',
                product: [
                    {
                        id: 31,
                        name: ' یخچال ساید بای ساید ال جی',
                        price: 100000000,
                        image: 'lg-side.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        country: 'کره جنوبی',
                    },
                    {
                        id: 32,
                        name: 'یخچال ساید بای ساید سامسونگ',
                        price: 120000000,
                        image: 'Samsung-side.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        country: 'کره جنوبی',
                    },
                    {
                        id: 33,
                        name: 'یخچال ساید بای ساید امرسان',
                        price: 120000000,
                        image: 'Samsung-side.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        country: 'کره جنوبی',
                    },
                    {
                        id: 34,
                        name: 'یخچال ساید بای ساید اسنوا',
                        price: 120000000,
                        image: 'snova.jpg',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                        country: 'کره جنوبی',
                        colors: ['زرد', 'آبی'],
                    },
                ]

            },
            {
                pr_id: 4,
                title: 'تلویزیون',
                product: [
                    {
                        id: 41,
                        name: 'تلویزیون  سامسونگ',
                        price: 50000000,
                        image: 'samsungtv.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                    },
                    {
                        id: 42,
                        name: 'تلویزیون ال جی',
                        price: 60000000,
                        image: 'lgtv.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                    },
                    {
                        id: 43,
                        name: 'تلویزیون سونی',
                        price: 60000000,
                        image: 'lgtv.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                    },
                ]
            },
            {
                pr_id: 5,
                title: 'لباسشویی',
                product: [
                    {
                        id: 51,
                        name: 'لباسشویی ال جی',
                        price: 15000000,
                        image: 'lgwash.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                    },
                    {
                        id: 52,
                        name: 'لباسشویی سامسونگ',
                        price: 20000000,
                        image: 'samsunglebas.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                    },
                    {
                        id: 53,
                        name: 'لباسشویی سونی',
                        price: 20000000,
                        image: 'samsunglebas.png',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                    },
                ]
            }
        ],

        products: [
            {
                id: 11,
                name: 'Samsung Galaxy S22',
                price: 40000000,
                image: 'S22.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'کره جنوبی',
                colors: ['زرد', 'آبی'],
            },
            {
                id: 12,
                name: 'Samsung Galaxy S21',
                price: 20000000,
                image: 'samsungs21.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'کره جنوبی',
                colors: ['زرد', 'آبی'],
            },
            {
                id: 13,
                name: 'Samsung Galaxy A52S',
                price: 12000000,
                image: 'a52s.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'کره جنوبی',
                colors: ['زرد', 'آبی'],

            },
            {
                id: 14,
                name: 'آیفون ۱۲',
                price: 12000000,
                image: 'applephone.jpg',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                country: 'کره جنوبی',
            },
            {
                id: 15,
                name: 'شیائومی می ۱۱',
                price: 12000000,
                image: 'xiaomiphone.jpg',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                country: 'کره جنوبی',
            },
            {
                id: 21,
                name: 'ساعت هوشمند شیائومی',
                price: 1000000,
                image: 'Xiaomi.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'چین',
                colors: ['زرد', 'آبی'],
            },
            {
                id: 22,
                name: 'ساعت هوشمند سامسونگ',
                price: 10000000,
                image: 'Samsung-watch.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'کره جنوبی',
                colors: ['زرد', 'آبی'],
            },
            {
                id: 23,
                name: 'ساعت هوشمند الجی',
                price: 10000000,
                image: 'Samsung-watch.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                country: 'کره جنوبی',
            },
            {
                id: 24,
                name: 'ساعت هوشمند اپل',
                price: 10000000,
                image: 'apple.jpg',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                country: 'کره جنوبی',
            },
            {
                id: 31,
                name: ' یخچال ساید بای ساید ال جی',
                price: 100000000,
                image: 'lg-side.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'ژاپن',
                colors: ['زرد', 'آبی'],
            },
            {
                id: 32,
                name: 'یخچال ساید بای ساید سامسونگ',
                price: 120000000,
                image: 'Samsung-side.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'کره جنوبی',
                colors: ['زرد', 'آبی'],
            },
            {
                id: 33,
                name: 'یخچال ساید بای ساید امرسان',
                price: 120000000,
                image: 'Samsung-side.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'کره جنوبی',
                colors: ['زرد', 'آبی'],
            },
            {
                id: 34,
                name: 'یخچال ساید بای ساید اسنوا',
                price: 120000000,
                image: 'snova.jpg',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'کره جنوبی',
                colors: ['زرد', 'آبی'],
            },
            {
                id: 41,
                name: 'تلویزیون  سامسونگ',
                price: 50000000,
                image: 'samsungtv.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'کره جنوبی',
                colors: ['زرد', 'آبی'],

            },
            {
                id: 42,
                name: 'تلویزیون ال جی',
                price: 60000000,
                image: 'lgtv.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'ژاپن',
                colors: ['زرد', 'آبی'],
            },
            {
                id: 43,
                name: 'تلویزیون  سونی',
                price: 60000000,
                image: 'lgtv.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'ژاپن',
                colors: ['زرد', 'آبی'],
            },
            {
                id: 51,
                name: 'لباسشویی ال جی',
                price: 15000000,
                image: 'lgwash.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'ژاپن',
                colors: ['زرد', 'آبی'],
            },
            {
                id: 52,
                name: 'لباسشویی سامسونگ',
                price: 20000000,
                image: 'samsunglebas.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'کره جنوبی',
                colors: ['زرد', 'آبی'],
            },
            {
                id: 53,
                name: 'لباسشویی سونی',
                price: 20000000,
                image: 'samsunglebas.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'کره جنوبی',
                colors: ['زرد', 'آبی'],
            },
        ],
        Discount:[
            {
                id: 1,
                name: 'لباسشویی سونی',
                price: 20000000,
                priceDiscount: 15000000,
                image: 'samsunglebas.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'کره جنوبی',
                colors: ['زرد', 'آبی'],
                discount:'25%'
            },
            {
                id: 2,
                name: 'تلویزیون  سونی',
                price: 60000000,
                priceDiscount: 30000000,
                image: 'lgtv.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'ژاپن',
                colors: ['زرد', 'آبی'],
                discount:'50%'
            },
            {
                id: 3,
                name: '  یخچال اسنوا',
                price: 120000000,
                priceDiscount: 60000000,
                image: 'snova.jpg',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'ژاپن',
                colors: ['زرد', 'آبی'],
                discount:'50%'
            },
            {
                id: 4,
                name: 'موبایل سامسونگ اس۲۱',
                price: 20000000,
                priceDiscount: 10000000,
                image: 'samsungs21.png',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'ژاپن',
                colors: ['زرد', 'آبی'],
                discount:'50%'
            },
            {
                id: 5,
                name: 'ساعت هوشمند اپل',
                price: 10000000,
                priceDiscount: 5000000,
                image: 'apple.jpg',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                country: 'ژاپن',
                colors: ['زرد', 'آبی'],
                discount:'50%'
            },
          
        ],

        Representatives: [
            {
                re_id: 1,
                title: 'نمایندگان شهر تهران',
                represent: [
                    {
                        id: 11,
                        address: ' خیابان انقلاب',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'


                    },
                    {
                        id: 12,
                        address: ' خیابان ۷تیر',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },
                    {
                        id: 13,
                        address: ' خیابان منیریه',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    }
                ]
            },
            {
                re_id: 2,
                title: 'نمایندگان شهر اصفهان',
                represent: [
                    {
                        id: 21,
                        address: ' خیابان امام',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },
                    {
                        id: 22,
                        address: ' خیابان ۷تیر',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },

                ]
            },
            {
                re_id: 3,
                title: 'نمایندگان شهر شیراز',
                represent: [
                    {
                        id: 31,
                        address: ' خیابان شهید بهشتی',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },
                    {
                        id: 32,
                        address: ' خیابان حافظ',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },
                    {
                        id: 32,
                        address: ' خیابان حافظ',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },


                ]
            },
            {
                re_id: 4,
                title: 'نمایندگان شهر ارومیه',
                represent: [
                    {
                        id: 41,
                        address: ' خیابان شهید باهنر',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },
                    {
                        id: 42,
                        address: ' خیابان سعدی',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },
                    {
                        id: 42,
                        address: ' خیابان خیام جنوبی',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },


                ]
            },
            {
                re_id: 5,
                title: 'نمایندگان شهر مشهد',
                represent: [
                    {
                        id: 51,
                        address: ' خیابان امام',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },
                    {
                        id: 52,
                        address: ' خیابان مولوی',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },
                    {
                        id: 53,
                        address: ' خیابان شهید مطهری',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },
                    {
                        id: 54,
                        address: ' خیابان شهید بهشتی',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'
                    },


                ]
            },
            {
                re_id: 6,
                title: 'نمایندگان شهر تبریز',
                represent: [
                    {
                        id: 61,
                        address: ' خیابان امام',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'

                    },
                    {
                        id: 62,
                        address: ' خیابان ستارخان',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'
                    },
                    {
                        id: 63,
                        address: ' خیابان باقرخان',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'
                    },
                    {
                        id: 64,
                        address: ' خیابان شهید بهشتی',
                        description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.',
                        image: 'city.png',
                        phone: '0123456789'
                    },


                ]
            }

        ],
       

        representatives: [
            {
                id: 11,
                address: ' خیابان انقلاب',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'


            },
            {
                id: 12,
                address: ' خیابان ۷تیر',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 13,
                address: ' خیابان منیریه',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 21,
                address: ' خیابان امام',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 22,
                address: ' خیابان ۷تیر',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 31,
                address: ' خیابان شهید بهشتی',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 32,
                address: ' خیابان حافظ',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 32,
                address: ' خیابان حافظ',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 41,
                address: ' خیابان شهید باهنر',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 42,
                address: ' خیابان سعدی',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 43,
                address: ' خیابان خیام جنوبی',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 51,
                address: ' خیابان امام',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 52,
                address: ' خیابان مولوی',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 53,
                address: ' خیابان شهید مطهری',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 54,
                address: ' خیابان شهید بهشتی',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'
            },

            {
                id: 61,
                address: ' خیابان امام',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'

            },
            {
                id: 62,
                address: ' خیابان ستارخان',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'
            },
            {
                id: 63,
                address: ' خیابان باقرخان',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'
            },
            {
                id: 64,
                address: ' خیابان شهید بهشتی',
                description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. ',
                image: 'city.png',
                phone: '0123456789'
            },

        ],

    },
    getters: {
        allProducts(state) {
            return state.Products
        },
        getProductById: (state) => (id) => {
            return state.products.find(pr => pr.id == id)
        },
        getProductsById: (state) => (id) => {
            return state.Products.find(pr => pr.pr_id == id)

        },
        allRepresentatives(state) {
            return state.Representatives
        },
        getRepresentById: (state) => (id) => {
            return state.representatives.find(pr => pr.id == id)
        },
        getRepresentsById: (state) => (id) => {
            return state.Representatives.find(pr => pr.re_id == id)
        },
        allItems: (state) => {
            return state.cart
        },
        allInterested: (state) => {
            return state.interested
        },
        count: (state) => {
            return state.cart.length
        },
        totalAmount(state) {
            return state.cart.reduce((total, p) => {
                return total + p.price * p.quantity
            }, 0)
        },
        getAllDiscount(state){
            return state.Discount
        }
    },
    mutations: {
        add(state, product) {
            const item = state.cart.find(p => p.id == product.id)
            if (!item) {
                state.cart.push({
                    ...product,
                    quantity: 1
                })
            }
            else {
                item.quantity++
            }
            updateLocalStorage(state.cart)
        },
        addToInterested(state,product){
            const item=state.interested.find(p=>p.id==product.id)
            if(!item){
                state.interested.push(product)
            }
            else{
                console.log('محصول وجود دارد');
            }
            updateLocalStorageInterested(state.interested)
        },
        increament(state, id) {
            const item = state.cart.find(p => p.id == id)
            if (item) {
                item.quantity++
            }
            updateLocalStorage(state.cart)
        },
        decreament(state, id) {
            const item = state.cart.find(p => p.id == id)
            if (item) {
                if (item.quantity > 1) {
                    item.quantity--
                }
            }
            updateLocalStorage(state.cart)
        },
        remove(state, id) {
            state.cart = state.cart.filter(cart => cart.id != id)
            updateLocalStorage(state.cart)
        },
        removeFromInterested(state,id){
            state.interested=state.interested.filter(interest=>interest.id!=id)
            updateLocalStorageInterested(state.interested)
        },
        clear(state) {
            state.cart = []
            updateLocalStorage(state.cart)
        },
        clearInterest(state){
            state.interested = []
            updateLocalStorageInterested(state.interested)
        }

    },
    actions: {
        addToCart({ commit }, product) {
            commit('add', product)
            Swal.fire({
                title: "محصول به سبد خرید اضافه شد",
                icon: "success",
                showConfirmButton: false,
                timerProgressBar: true,
                timer: 3000,
                toast: true,
                position: 'top',
            });
        },
        addToInterested({ commit }, product) {
            commit('addToInterested', product)
            Swal.fire({
                title: "محصول  به لیست علاقه مندی اضافه شد",
                icon: "success",
                showConfirmButton: false,
                timerProgressBar: true,
                timer: 3000,
                toast: true,
                position: 'top',
            });
        },
        increament({ commit }, id) {
            commit('increament', id)
            Swal.fire({
                title: "محصول به سبد خرید اضافه شد",
                icon: "success",
                showConfirmButton: false,
                timerProgressBar: true,
                timer: 3000,
                toast: true,
                position: 'top',
            });
        },
        decreament({ commit }, id) {
            commit('decreament', id);
            Swal.fire({
                title: "محصول کم شد",
                icon: "success",
                showConfirmButton: false,
                timerProgressBar: true,
                timer: 3000,
                toast: true,
                position: 'top',
            });
        },
        remove({ commit }, id) {
            commit('remove', id);
            Swal.fire({
                title: "محصول حذف شد",
                icon: "warning",
                showConfirmButton: false,
                timerProgressBar: true,
                timer: 3000,
                toast: true,
                position: 'top',
            });
        },
        removeFromInterested({commit},id){
            commit('removeFromInterested',id);
            Swal.fire({
                title: "محصول حذف شد",
                icon: "warning",
                showConfirmButton: false,
                timerProgressBar: true,
                timer: 3000,
                toast: true,
                position: 'top',
            });
        },
        clear({ commit }) {
            commit('clear');
            Swal.fire({
                title: "سبد خرید پاک شد",
                icon: "warning",
                showConfirmButton: false,
                timerProgressBar: true,
                timer: 3000,
                toast: true,
                position: 'top',
            });
        },
    
    clearInterest({commit}){
        commit('clearInterest');
        Swal.fire({
            title: "لیست علاقه مندی ها پاک شد",
            icon: "warning",
            showConfirmButton: false,
            timerProgressBar: true,
            timer: 3000,
            toast: true,
            position: 'top',
        });
    },
},
    modules: {
    }
})
